"""
2. Реалізувати функцію nested_parentheses(incoming). Функція отримує рядок, який складається тільки зі знаків "(" або ")"
    Рядок вважається таким, що містить коректно вкладені скобки, якщо для кожної скобки "(" існує відповідна ")".  Функція повертає булевську змінну, яка показує, чи      містить вхідний рядок тільки правильно вкладені скобки - True, чи ні - False. Приклад результату виконання функції відповідно до різних варіантів вхідних рядків:
    incoming = "((())(())())" => True
    incoming = "" => True
    incoming = "(((())))" => True
    incoming = "())" => False
    incoming = "(()()(())" => False
"""